app/controllers/api/v1/sub_headers_controller.rb

  def index
    @sub_headers = SubHeader.all
---
SELECT "sub_headers".* FROM "sub_headers"