app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @Users = User.all

INSERT INTO "users" ("username", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "brandon"], ["first_name", "brandon"], ["last_name", "harris"], ["password_digest", "123"], ["created_at", "2018-01-03 00:06:41.774943"], ["updated_at", "2018-01-03 00:06:41.774943"]]
---
  def create
    @user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def set_user
    @user = User.find(params[:id])