app/controllers/api/v1/user_subjects_controller.rb

SELECT "user_subjects".* FROM "user_subjects"
---
  def index
    @user_subjects = UserSubject.all