app/controllers/sub_headers_controller.rb

SELECT "sub_headers".* FROM "sub_headers"
---
  def index
    @sub_headers = SubHeader.all