app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @Users = User.all

INSERT INTO "users" ("username", "first_name", "last_name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["username", "Genny4"], ["first_name", "Genny4"], ["last_name", "Genny4"], ["password_digest", "Genny4"], ["created_at", "2017-12-28 03:00:47.362132"], ["updated_at", "2017-12-28 03:00:47.362132"]]
---
  def create
    # user = User.find_by(username: params[:username])
    # if user.authenticate(params[:passowrd])
    #   render json: {username:user.username, id: user.id}
    # else
    #   render json:{error: 'Invalid User hoe!'}, status: 401
    # end
    @user = User.create(user_params)